app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums"
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "TWljaGFlbCBKYWNrc29u"], ["LIMIT", 1]]
SELECT 1 AS one FROM "albums" WHERE "albums"."artist_id" = ? LIMIT ?  [["artist_id", "TWljaGFlbCBKYWNrc29u"], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", "TWljaGFlbCBKYWNrc29u"]]
---
  def index
    #Si no tengo parametros muestro todos los albums
    if params[:name].blank? && params[:genre].blank? && params[:artist_id].blank?
      @albums = Album.all
      render json: @albums, status: 200
    end

    if params[:artist_id].blank? == false
      # Retornar todos los albums del artista <artist_id> si existe
      if Album.where(artist_id: params[:artist_id]).exists?
        @albums = Album.where(artist_id: params[:artist_id])

SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "cGVhY2U6VFdsamFHRmxiQ0"], ["LIMIT", 1]]
SELECT 1 AS one FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "cGVhY2U6VFdsamFHRmxiQ0"], ["LIMIT", 1]]
---
  def show
    #Encontrar album
    if Album.where(id:params[:id]).exists?
      @album = Album.find(params[:id])

SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "TWljaGFlbCBKYWNrc29u"], ["LIMIT", 1]]
SELECT 1 AS one FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "RGFuaQ=="], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "RGFuaUFsYnVtOlJHRnVhUT"], ["LIMIT", 1]]
SELECT 1 AS one FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", "T2ZmIHRoZSBXYWxsOlRXbG"], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", "T2ZmIHRoZSBXYWxsOlRXbG"], ["LIMIT", 1]]
INSERT INTO "albums" ("artist_id", "id", "name", "genre", "artist_url", "tracks_url", "self_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create

    #Si alguno de los parametros viene vacio
    if (params[:name].blank? || params[:genre].blank?)
      return render status: 400
    end

    string = params[:name]
    genre = params[:genre]
    id_art = params[:artist_id]
    encoded = Base64.encode64("#{string}:#{id_art}")
    encoded = encoded[0...22].strip

    #Si el artista no existe
    if Artist.where(id: params[:artist_id]).exists? == false
      return render status: 422
    end

    #Si el album ya existe
    if Album.where(id: encoded).exists?
      album  = Album.find(encoded)
      return render json: album, status: 409
    end

    @encoded_album = Album.new(id: encoded,artist_id: id_art , name: string, genre: genre, artist_url:"https://afternoon-depths-40075.herokuapp.com/artists/#{encoded}", tracks_url: "https://afternoon-depths-40075.herokuapp.com/#{encoded}/tracks" , self_url:"https://afternoon-depths-40075.herokuapp.com/albums/#{encoded}")

    # Si viene todo completo
    if @encoded_album.save

SELECT 1 AS one FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "RGFuaUFsYnVtOlJHRnVhUT"], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "RGFuaUFsYnVtOlJHRnVhUT"], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = ?  [["album_id", "RGFuaUFsYnVtOlJHRnVhUT"]]
UPDATE "tracks" SET "times_played" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["times_played", 1], ["updated_at", "2021-05-02 23:31:26.038020"], ["id", "VHJhY2sxOlJHRnVhVUZzWW"]]
---
  def play
    #Si el album id existe
    if Album.where(id:params[:id]).exists?
      albums = Album.find(params[:id])
      id_album = albums.id
      tracks = Track.where(album_id: id_album)

      tracks.each do |track|
        track.times_played += 1
        track.save

SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "T2ZmIHRoZSBXYWxsOlRXbG"], ["LIMIT", 1]]
SELECT 1 AS one FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "T2ZmIHRoZSBXYWxsOlRXbG"], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", "T2ZmIHRoZSBXYWxsOlRXbG"]]
---
  def destroy
    #Elimina el album <album_id> y todos sus albums
    if Album.where(id:params[:id]).exists?
      @album = Album.find(params[:id])
      @album.destroy