app/controllers/artists_controller.rb

  def index
    #if que
    @artists = Artist.all
---
SELECT "artists".* FROM "artists"

  def show
    if Artist.where(id:params[:id]).exists?
      @artist = Artist.find(params[:id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "TWljaGFlbCBKYWNrc29u"], ["LIMIT", 1]]
SELECT 1 AS one FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "fgds"], ["LIMIT", 1]]

  def create

    if params[:name].blank? || params[:age].blank?
      return render status: 400
    end

    str = params[:name]
    age = params[:age]
    encoded = Base64.encode64(str)
    encoded = encoded[0...22].strip

      #Si el artista ya existe
    if Artist.where(id: encoded).exists?
      artist = Artist.find(encoded)
      return render json: artist, status:409
    end

    if (params[:name].blank? && params[:age].blank?) == false && (Artist.where(id:params[:id]).exists? == false)
      @encoded_artist = Artist.new(id: encoded, name: str, age: age, albums_url:"https://afternoon-depths-40075.herokuapp.com/artists/#{encoded}/albums",
        tracks_url: "https://afternoon-depths-40075.herokuapp.com/#{encoded}/tracks" , self_url:"https://afternoon-depths-40075.herokuapp.com/artists/#{encoded}")

      if @encoded_artist.save
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", "TWljaGFlbCBKYWNrc29u"], ["LIMIT", 1]]
SELECT 1 AS one FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", "TWljaGFlbCBKYWNr"], ["LIMIT", 1]]
SELECT 1 AS one FROM "artists" WHERE "artists"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
INSERT INTO "artists" ("id", "name", "age", "albums_url", "tracks_url", "self_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def play
    if Artist.where(id: params[:id]).exists?
      albums = Album.where(artist_id: params[:id])
      albums.each do |album|
        tracks = Track.where(album_id: album.id)
        tracks.each do |track|
          track.times_played += 1
          track.save
---
SELECT 1 AS one FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "ZGFuaWVsYSB2"], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", "ZGFuaWVsYSB2"]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "QWxidW0xOlpHRnVhV1ZzWV"], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = ?  [["album_id", "QWxidW0xOlpHRnVhV1ZzWV"]]
UPDATE "tracks" SET "times_played" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["times_played", 1], ["updated_at", "2021-05-02 23:49:46.446764"], ["id", "dHJhY2sxOlFXeGlkVzB4T2"]]

  def destroy
    if Artist.where(id:params[:id]).exists?
      @artist = Artist.find(params[:id])
      @artist.destroy
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "TWljaGFlbCBKYWNrc29u"], ["LIMIT", 1]]
SELECT 1 AS one FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "TWljaGFlbCBKYWNrc29"], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", "TWljaGFlbCBKYWNrc29u"]]