app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("album_id", "id", "name", "duration", "times_played", "artist_url", "album_url", "self_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def index
    #Si no tengo parametros muestro todos los tracks
    if params[:name].blank? && params[:duration].blank? && params[:album_id].blank? && params[:artist_id].blank?
       @tracks = Track.all
       return render json: @tracks, status: 200
    end

    #Mostrar todos los tracks del artista
    if params[:artist_id].blank? == false

      if Artist.where(id: params[:artist_id]).exists?
        array = []
        albums = Album.where(artist_id: params[:artist_id])
        albums.each do |album|
          tracks = Track.where(album_id: album.id)
          tracks.each do |track|
            track.save
            array << track