app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
SELECT 1 AS one FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "ZGFuaWVsYSB2"], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", "ZGFuaWVsYSB2"]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = ?  [["album_id", "T2ZmIHRoZSBXYWxsOlRXbG"]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = ?  [["album_id", "QWxidW0xOlpHRnVhV1ZzWV"]]
SELECT 1 AS one FROM "tracks" WHERE "tracks"."album_id" = ? LIMIT ?  [["album_id", "QWxidW0xOlpHRnVhV1ZzWV"], ["LIMIT", 1]]
---
  def index
    #Si no tengo parametros muestro todos los tracks
    if params[:name].blank? && params[:duration].blank? && params[:album_id].blank? && params[:artist_id].blank?
       @tracks = Track.all
       return render json: @tracks, status: 200
    end

    #Mostrar todos los tracks del artista
    if params[:artist_id].blank? == false

      if Artist.where(id: params[:artist_id]).exists?
        #array = []
        albums = Album.where(artist_id: params[:artist_id])
        albums.each do |album|
          track = Track.where(album_id: album.id)
          #array << track
        end
        #arr = array.map
        return render status: 200

      #Artista no encontrado
      else
         return render status: 404
      end

    end

    if params[:album_id].blank? == false
      #Retorna todas las canciones del album <album_id>
      if Track.where(album_id: params[:album_id]).exists?
        @tracks = Track.where(album_id: params[:album_id])

SELECT 1 AS one FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", "RG9uJ3QgOmNHVmhZMlU2Vk"], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", "RG9uJ3QgOmNHVmhZMlU2Vk"], ["LIMIT", 1]]
---
  def show
    #Buscar id de track
    if Track.where(id:params[:id]).exists?

SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "QWxidW0xOlpHRnVhV1ZzWV"], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "cGVhY2U6VFdsamFHRmxiQ0"], ["LIMIT", 1]]
SELECT 1 AS one FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", "RG9uJ3Qgc3RvcDpjR1ZoWT"], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", "RG9uJ3Qgc3RvcDpjR1ZoWT"], ["LIMIT", 1]]
INSERT INTO "tracks" ("album_id", "id", "name", "duration", "times_played", "artist_url", "album_url", "self_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    #Que alguno de los parametros falte
    if params[:name].blank? || params[:duration].blank?
      return render status: 400
    end

    #Si el album no existe
    if Album.where(id: params[:album_id]).exists? == false
      return render status: 422
    end

    nam = params[:name]
    dur = params[:duration]
    id_album = params[:album_id]
    encoded = Base64.encode64("#{nam}:#{id_album}")
    encoded = encoded[0...22].strip
    id_art = Album.find(params[:album_id]).artist_id

    #Si la cancion ya existe
    if Track.where(id: encoded, album_id: params[:album_id]).exists?
      song = Track.find(encoded)
      return render json: song, status: 409
    end

    @track = Track.new(id: encoded, album_id: params[:album_id], name: nam, duration: dur, times_played: 0, artist_url: "https://afternoon-depths-40075.herokuapp.com/artists/#{id_art}",album_url: "https://afternoon-depths-40075.herokuapp.com/albums/#{id_album}", self_url: "https://afternoon-depths-40075.herokuapp.com/tracks/#{encoded}")

    if @track.save

UPDATE "tracks" SET "times_played" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["times_played", 1], ["updated_at", "2021-05-02 23:10:33.552545"], ["id", "RG9uJ3Qgc3RvcDpjR1ZoWT"]]
---
  def update
    if @track.update(params)

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", "RG9uJ3Qgc3RvcDpjR1ZoWT"], ["LIMIT", 1]]
SELECT 1 AS one FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", "RG9uJ3Qgc3RvcDpjR1ZoWT"], ["LIMIT", 1]]
UPDATE "tracks" SET "times_played" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["times_played", 1], ["updated_at", "2021-05-02 23:10:33.552545"], ["id", "RG9uJ3Qgc3RvcDpjR1ZoWT"]]
---
  def play
    #Buscar si existe
    if Track.where(id:params[:id]).exists?
      track = Track.find(params[:id])
      track.times_played += 1
      track.save